//
// Created by User on 4/6/2021.
//

/*
 * Στην κλάση Unordered_Array υλοποιείται η δομή της αταξινόμητου πίνακα.
 */

#include "Unordered_Array.h"
/*
 * Ο κατασκευαστής, αρχικοποιεί το τιμές των μεταβλητών size, pos αλλά και τους δυναμικούς πίνακες arr και numofwords με
 * μέγεθος size. Η μεταβλητή size είναι το μέγεθος των δυναμικών πινάκων arr και numofwords, η pos είναι ο αριθμός των μοναδικών λέξεων
 * που έχουν προστεθεί, στον δυναμικό πίνακα συμβολοσειρών arr αποθηκεύεται κάθε μοναδική λέξη και στον δυναμικό πίνακα
 * ακεραίων numofwords αποθηκεύεται ο αριθμός εμφανίσεων κάθε λέξης.
 */
Unordered_Array::Unordered_Array() {
    size = 100000;
    pos = 0;
    arr = new string [size];
    numofwords = new int [size];
}

/*
 * Ο καταστροφέας, διαγράφει του δύο δυναμικούς πίνακες arr και numofwords.
 */
Unordered_Array::~Unordered_Array() {
    delete [] arr;
    delete [] numofwords;
}
/*
 * Η συνάρτηση find() δέχεται δύο ορίσματα την συμβολοσειρά in και τον ακέραιο αριθμό mode, και επιστρέφει 1 αν η λέξη
 * in υπάρχει στην δομή ή 0 αν δεν υπάρχει. Η μέθοδος αναζήτησης που χρησιμοποιείται είναι η σειριακή αναζήτηση. Η τιμή
 * του mode καθορίζει την λειτουργεία της συνάρτησης. Αν το mode ισούται με 1 τότε σε περίπτωση που η λέξη υπάρχει
 * αυξάνεται η αντίστοιχη τιμή στον πίνακα numofwords κατά ένα, αυτή η λειτουργεία χρησιμοποιείται κατά την εισαγωγή
 * λέξεων στην δομή. Αν το mode ισούται με 2 τότε η συνάρτηση εμφανίζει την λέξη μαζί με τον σύνολο εμφανίσεων της. Σε
 * περίπτωση που το mode έχει οποιαδήποτε άλλη τιμή τότε η συνάρτηση λειτουργεί ως μία απλή συνάρτηση αναζήτησης.
 */
int Unordered_Array::find(string in, int mode) {
    for (int i = 0; i < pos; ++i) {
        if (in == arr[i]){
            if (mode == 1){
                numofwords[i]++;
            } else if (mode == 2){
                cout << in << ", " << numofwords[i] << endl;
            }
            return 1;
        }
    }
    if (mode == 2){
        cout << in << ", 0" << endl;
    }
    return 0;
}

/*
 * Η συνάρτηση Insert() δέχεται ένα όρισμα την συμβολοσειρά in. Σε περίπτωση που η λέξη δεν υπάρχει ήδη στην δομή τότε
 * ελέγχεται εάν μπορεί να προστεθεί στην δομή. Αν μπορεί τότε προστίθεται στη θέση pos δηλαδή στο τέλος των λέξεων που
 * έχουν ήδη προστεθεί. Αν δεν υπάρχει χώρος για την προσθήκη της τότε δημιουργείται δύο καινούργιοι προσωρινούς πίνακες
 * με διπλάσιο μέγεθος, αντιγράφονται οι λέξεις και ο αριθμός εμφάνισής τους και μετά αντιγράφονται οι καινούργιοι
 * πίνακες στους παλιούς και μετά προστίθεται η λέξη.
 */
void Unordered_Array::Insert(string n) {
    if (find(n, 1) == 0){
        if (pos == size){
            int *temp2;
            temp2 = new int[2*size];
            for (int i=0; i<size; i++){
                temp2[i] = numofwords[i];
            }
            delete[] numofwords;
            numofwords = temp2;

            string *temp;
            temp = new string[2*size];
            for (int i=0; i<size; i++){
                temp[i] = arr[i];
            }
            delete[] arr;
            arr = temp;
            size *= 2;
        }
        arr[pos] = n;
        numofwords[pos] = 1;
        pos++;
    }
}

/*
 * Η συνάρτηση Delete() δέχεται ως όρισμα την συμβολοσειρά d. Σε περίπτωση που υπάρχει μειώνει τον αριθμό εμφανίσεων
 * της (numofwords) κατά ένα. Εάν μετά την αφαίρεση η τιμή του numofwords είναι ίση με το 0 τότε η λέξη αφαιρείται από
 * την δομή, αλλάζοντας την θέση της με την τελευταία λέξη της δομής μαζί με τους αριθμούς εμφάνισης και διαγράφεται από
 * την δομή μαζί με τον αριθμό εμφανίσεων της.
 */
void Unordered_Array::Delete(string d) {
    for (int i = 0; i < pos; ++i) {
        if (d == arr[i]){
            numofwords[i]--;
            if(numofwords[i]==0){
                swap(arr[i], arr[pos-1]);
                swap(numofwords[i], numofwords[pos-1]);
                arr[pos-1] = "";
                pos--;
            }
            break;
        }
    }
}